BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
  if( digitalRead(CHARGER_DETECT_PIN) ){  
    Serial.print("\nCharging.");
    pinMode(CHARGER_DETECT_PIN, FUNCTION_0);    //Returns to original state.
    return true;
  }
  else{ 
    Serial.print("\nNot charging.");
    pinMode(CHARGER_DETECT_PIN, FUNCTION_0);    //Returns to original state.
    return false; 
  } 
}

bool reedSwitchIsPressed(void){
  //Returns true if reed switch is pressed (when GPIO associated is in logic 1).
  if(digitalRead(REED_SWITCH_PIN)){  
    // digitalWrite(REED_SWITCH_PIN, LOW);   //Discharge capacitor  -> maybe this whould be implemented before deep sleep.
    // pinMode(REED_SWITCH_PIN, OUTPUT);     //Change pin to ouput.
    // pinMode(REED_SWITCH_PIN, INPUT);    //Put pin at the original type.
    return true;
  }
  else  return false;
}

void dischargeCapacitor(void){
  pinMode(REED_SWITCH_PIN, OUTPUT);     
  digitalWrite(REED_SWITCH_PIN, LOW);   //Put pin in 0 to discharge capacitor
  // delay(1);                      //waits a while till it discharges.
  pinMode(REED_SWITCH_PIN, INPUT);      //Put the pin as input again (to sense).
}

void LED_Color(uint32_t color){   //8-bit colors
  uint16_t r, g, b;
  Serial.printf("\n color: %X", color);

  r = (color >> 16) & 0xFF;
  g = (color >> 8) & 0xFF;
  b = (color) & 0xFF;

  r = (r*100)/255;    //Convert to percentage for duty cycle.  -> Not needed
  g = (g*100)/255;
  b = (b*100)/255;
 
  r = 1023-((1023*r)/100);          //Invert value because LEDs are in high side (common annode).
  g = 1023-((1023*g)/100);
  b = 1023-((1023*b)/100);

  pinMode(LED_R_PIN, OUTPUT);
  pinMode(LED_G_PIN, OUTPUT);
  pinMode(LED_B_PIN, OUTPUT);
  digitalWrite(LED_R_PIN, HIGH);    //Turn off leds.
  digitalWrite(LED_G_PIN, HIGH);
  digitalWrite(LED_B_PIN, HIGH);

  analogWrite(LED_R_PIN, r); 
  analogWrite(LED_G_PIN, g); 
  analogWrite(LED_B_PIN, b); 
}

bool writeDataToFlash(String path, void* data, unsigned int bytes) { // send the right file to the client (if it exists)
  //todo: validate data and bytes parameters. ALso chech if path exists to avoid creating multiple files unnecessarily.
  
  Serial.printf("\n\n Data to write to flash:\n  buf=");
  for (uint16 i = 0; i < bytes; i++)
  {
    Serial.printf("%X ", ((const char*)data)[i]);
  }

  File file = SPIFFS.open(path, "a"); //Opens file specified in path parameter to write.
  if (!file) {    //If file is unable to open...
    Serial.println("Error opening file for writing");
    return false;
  }
  else{     //If file opened correctly...
    
    // Serial.printf("\nCursor position at %d",file.seek(0,fs::SeekEnd));     //Put cursor to the end of the file.
    unsigned int pos = 0;//file.position();
    int bytesWritten = file.write((const char*)data,bytes);
    // int bytesWritten = file.printf("measurement: %d\n",millis());
    if (bytesWritten > 0) {
        Serial.printf("\nFile was written in position %d, %d bytes", pos, bytesWritten);
    } else {
      Serial.println("\nFile write failed");
    }
    file.close();
    return true;
  }
}

bool readDataFromFlash(String path, uint32_t index, void* data, unsigned int bytes){

  File file = SPIFFS.open(path, "r");   //Open file

  if (!file) {
    Serial.println("Failed to open file for reading");
    return false;
  }
  else{
    file.seek(index, fs::SeekSet);    //Move the cursor "index" bytes from the beginning.
    uint16 currpos = file.position();
    Serial.printf("\ncurrpos = %d\n", currpos);
    for (uint16 i = 0; i < bytes; i++)  //Read "bytes" number of bytes from the index position. 
    {
      ((uint8_t*)data)[i] = file.read(); 
      Serial.printf("%X ",((uint8_t*)data)[i]); //Prints file content.
    } 

    file.close();    //Close file.
    return true;
  }
}

bool archiveWrite(void* data, uint16_t bytes){
  //Write "bytes" number of packets into the archive (flash memory).
  if(bytes >= RTC_MEMORY_MEASUREMENT_BLOCK_SIZE){
    
    // Serial.printf("\n\n Data to write to archive:\n  buf=");
    // for (uint16 i = 0; i < bytes; i++)
    // {
    //   Serial.printf("%X ", ((const char*)data)[i]);
    // }

    File file = SPIFFS.open(MEASUREMENTS_FILE_NAME, "a"); //Opens archive file to append measurements.
    Serial.printf("\nArchive file size: %d bytes",file.size());
    if (file) {    //If file opened correctly...
      
      int bytesWritten = file.write((const char*)data,bytes);

      if (bytesWritten == bytes) {  //If every byte is written...
        rtcmem.var.archive_saved_pointer=archiveGetPointer();   //Move pointer.
        rtcmem.rwVariables();
        Serial.printf("\nFile was written, %d bytes",bytesWritten);
      }else {
        Serial.println("\nFile write failed");
        file.close();
        return false;
      }
      file.close();
      return true;
    }
    else{        //If file is unable to open...
      Serial.println("Error opening file for writing");
    }
  }
  return false;
}

uint32_t archiveRead(void* data, uint32_t first_packet, uint32_t packets){
  /*  This function gets "packets" number of packets from the archive, starting from the "first_packet".
      If packets value is illegal (null or greater than the maximum possible) then returns 0.
      If packets is valid, it will read the amount specified and load it to *data. Then returns the amount read.
  */

  //If packets to be read are null or exceed the maximum available,  return 0. 
  if(first_packet + packets < rtcmem.rwVariables().archive_saved_pointer && packets != 0){
    
    uint32_t total_bytes = packets*sizeof(Measurement);
    
    File file = SPIFFS.open(MEASUREMENTS_FILE_NAME, "r");   //Open file
    if (file){        //If file opens correctly...
      //If file end is not going to be reached...
      if( file.available() >= total_bytes )
      { 
          file.seek(first_packet*sizeof(Measurement),
                    fs::SeekSet);    //Move the cursor to the first_packet position.
          
          /////// DEBUG /////
          // Serial.printf("archiveRead() first_packet: %d, last_packet: %d,   seek value:%d", first_packet, last_packet, first_packet*sizeof(Measurement));
          // Serial.printf("\nData read from archive:   (currpos = %d)\n", file.position());   //For debugging...
          ///////////////////
          for (uint32 i = 0; i < total_bytes; i++)    //Writes data output buffer
          {
            ((uint8_t*)data)[i] = file.read(); 
            // Serial.printf("%X ",((uint8_t*)data)[i]); //Prints file content.                //For debugging...  
          }
          file.close();    //Close file.
          return packets;
      }
      else{
        file.close();    //Close file.
        return 0;
      }
    }
    else{         //If file fails to open...
      Serial.println("Failed to open file for reading");
      return 0;
    }
  }
  else{
    return 0;
  }
}

uint32_t archiveGetPointer(void){
  //Return position of pointer, where next packet will be written.
  uint32_t size = 0;
  File file = SPIFFS.open(MEASUREMENTS_FILE_NAME, "r");   //Open file
    if (file){        //If file opens correctly...
      size = file.size();
      file.close();    //Close file.
      // Serial.printf("\nFile size = %d)\n", size);   //For debugging...
    }
  return (1+size/(RTC_MEMORY_MEASUREMENT_BLOCK_SIZE*RTC_MEMORY_BLOCK_SIZE));   
}

