BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
    return 0;
    //Connection failed.
  }


  // Serial.printf("\n Time taken: %dms.", (int)(millis() - start_time)); */
}

uint32_t getServerTimeUnix(void){ //Obsolete!!
  //Cnnects to server, sends a request and returns unix time in UTC from server.
  return 0;
}

int32_t generateMeasurementValue(unsigned char type, float value){
  int32_t measurement=0; 

  if (type == TEMPERATURE){
     // -200 ~ 800 -> -20ºC to 80ºC
     measurement = (int16_t)(value*10);
  }
  else if (type == HUMIDITY)
  { // 0 ~ 100 ->  0% to 100%
    measurement = (uint8_t)(value);
  }
  return(measurement);
}

String formatMeasurementValue(unsigned char type, float value){  //Converts measurements into valid format
  char measurement [10];  //4B string array for the value.
  measurement[(sizeof(measurement)-1)] = 0; //Put NULL character at the end of the string.

  if (type == TEMPERATURE){
     // -200 ~ 800 -> -20ºC to 80ºC
     itoa((signed short int)(value * 10), measurement, 10);   //Takes the first digit after comma.
  }
  else if (type == HUMIDITY)
  { // 0 ~ 100 ->  0% to 100%
    itoa((unsigned char)(value), measurement, 10);    //Takes only integer part.
  }

  measurement[(sizeof(measurement)-1)] = 0; //Put NULL character at the end of the string
  Serial.printf("\n\nMeasurement:");
  Serial.printf(measurement);
  return( String(measurement) );
}

void* stringToArray(std::string origin_string){
    //This function should return -1 if the size of "a" (destination array) is smaller than "s"
    //to avoid buffer overflow and possible fragmentation faults...
    int string_length = (origin_string.length()) + 1 ;

    char* s = (char*) malloc(string_length);
    strcpy(s, origin_string.c_str());

    return (s);
}

void goDeepSleep(uint64_t time){
  // time is in milliseconds.
  
  if( time > 3600000 ) time = 3600000;  //Maximum 1h (3600 sec).
  
  uint32_t t = time/1000;
 
  rtcmem.setElapsedTime(t + millis()/1000);   //in seconds

  Serial.printf("\nGoing deep sleep for %d seconds... ", (t));

  ESP.deepSleep(time*1000, WAKE_RF_DISABLED);  //deep sleeps for 5 seconds...
}

void setSensorPower(unsigned char state){
  if (state == ON)
  {
    digitalWrite(PWR_SENSORS_PIN_P, LOW);  //Turn sensors supply on.
    digitalWrite(PWR_SENSORS_PIN_N, HIGH);  //Turn sensors supply on.
    // Serial.printf("\nSensors turned on.");
  }
  if (state == OFF)
  {
    digitalWrite(PWR_SENSORS_PIN_P, HIGH);  //Turn sensors supply off.
    digitalWrite(PWR_SENSORS_PIN_N, LOW);  //Turn sensors supply on.
    // Serial.printf("\nSensors turned off.");
  }
}

void wifiTurnOff(void){
  WiFi.disconnect(true);  //Turns off wifi module, so in the wake up it won\\\"t turn on automatically until required.
  delay(1);
  WiFi.mode( WIFI_OFF );  //Wifi starts turned off after wake up, in order to save energy.
  delay(1);
  WiFi.forceSleepBegin(); 
  delay(1);
}

void wifiTurnOn(void){
  WiFi.forceSleepWake();    //Turns on radio.
  delay(1);   //Necessary delay to settle.
  WiFi.mode(WIFI_STA);  // Bring up the WiFi connection.
  WiFi.persistent(false); //Wifi credentials loaded directly from flash (as specified below) and not overwritten to it.
}

bool initglobals(void){
  /*  Read configuration file (JSON) and load data into Config_globals struct. 
  First load all the data from file into a string, and then parse it to a Json buffer,
  to then extract the values from each keyword.
  If file not found, load default values, defined in this function.
  */

  config_globals = readGlobals();
  
  return false;
}

//////////////////////////// WEB SERVER FUNCTIONS /////////////////////////////////
unsigned char runWebServer(void){ 

  String ap_ssid="Datalogger";
  String ap_pssw="123456789!";
  
  IPAddress local_IP(192,168,0,170);  //192.168.2.2
  IPAddress gateway(192,168,0,1);   //192.168.2.1
  IPAddress subnet(255,255,255,0);  //255.255.255.255
  // WiFi.softAPConfig(local_IP, gateway, subnet);
  WiFi.mode(WIFI_AP);
  while(!WiFi.softAP(ap_ssid, ap_pssw))
  {
    Serial.println(".");
    delay(100);
  }
 
 
  // wifiTurnOn();
  // WiFi.config(local_IP, gateway, subnet);
  // WiFi.begin(config_globals.network_ap_ssid, config_globals.network_ap_pass);
  // while(WiFi.status() != WL_CONNECTED){ //Blocks until Wifi is connected. 
  //   digitalWrite(LED_B_PIN, LOW); //Blink GREEN led.
  //   delay(50);
  //   digitalWrite(LED_B_PIN, HIGH);
    
  //   yield(); 
  // }

  LED_Color(COLOR_YELLOW); //Turns on red LED.
  //analogWriteFreq(5);   //See minimum frequency

  // start server
  server.begin();
  Serial.println("HTTP server started");

  Serial.println("");
  Serial.print("Initialized AP:\t");
  Serial.println(ap_ssid);
  Serial.print("IP address:\t");
  Serial.println(WiFi.softAPIP());
  Serial.print("MAC address:\t");
  Serial.println(WiFi.macAddress());
 
  
  server.on("/",handleHome);
  server.on("/change_network_config", handleChangeNetworkConfig);
  server.on("/change_server_config", handleChangeServerConfig);
  server.on("/format_ram",handleFormatRam);
  server.on("/format_flash",handleFormatFlash);
  server.on("/reset_archive_sent_pointer",handleResetSentPointer);
  server.on("/device_turn_off",handleTurnOffDevice);
  server.on("/get_parameters",handleGetParameters);
  server.on("/device_config",handleChangeConfig);


  

  return(1);
}

void handleHome(void){
  Serial.print("\n/");
  //Returns main page.
  server.send(200, "text/html", index_html);
}

void handleChangeNetworkConfig(void){
    Serial.print("/change_network_config");
    String new_ssid, new_password;
    
    if (server.hasArg("new_ssid") && server.hasArg("new_password"))
    {
        // new_ssid = server.arg("new_ssid");
        // new_password = server.arg("new_password");
        server.arg(0).toCharArray(config_globals.network_ap_ssid, sizeof(config_globals.network_ap_ssid));
        server.arg(1).toCharArray(config_globals.network_ap_pass, sizeof(config_globals.network_ap_pass));
        //Change parameters in Flash config file.
        saveGlobals();

        server.send(200, "text/plain", "Network credentials modified correctly.");
        // Serial.printf("\nNetwork credentials modified:\nSSID:%s\nPass:%s",new_ssid,new_password);
    }
    else
    {
        server.send(200, "text/html", "ERROR: Wrong parameters.");
    }
}

void handleChangeServerConfig(void){
  Serial.print("/change_server_config");
  String new_ip, new_port;
  
