BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
  if (server.hasArg("ip") && server.hasArg("port"))
  {
      new_ip = server.arg("new_ip");
      new_port = server.arg("new_port");
      /* Validate ip and port number */
      server.arg(0).toCharArray(config_globals.server_ip, sizeof(config_globals.server_ip));
      config_globals.server_port=server.arg(1).toInt();

      saveGlobals();

      //Change parameters in Flash config file.
      server.send(200, "text/plain", "Server parameters modified correctly.");
      // Serial.printf("\nServer parameters modified:\nIP:%s\nPort:%s",new_ip,new_port);
  }
  else
  {
      server.send(200, "text/html", "ERROR: Wrong parameters.");
  } 
}

unsigned char handleFormatRam(void){
  if (server.hasArg("command"))
  {
    if(server.arg("command") == "format_confirm"){
      /*Call to format RAM*/
      rtcmem.clear();                   //Reset values to dafault.
      rtcmem.safeDisconnect();          //Saves current values in NVM.
      Serial.printf("RAM Formatted.");
      server.send(200, "text/plain", "Server parameters modified correctly.");

      return(1);  //Returns 1 to inform that RAM has been erased correctly. This should drive to a reboot.
    }
  }
  server.send(200, "text/html", "ERROR: Wrong parameters.");
  return(0);  //Returns 1 to inform that RAM has NOT been erased correctly.
}

unsigned char handleFormatFlash(void){
  
  if(SPIFFS.remove(MEASUREMENTS_FILE_NAME)){    //Delete file.
    //SPIFFS.format();
    SPIFFS.remove(NVM_POINTERS_FILE_NAME);    //Delete variables backup.
    // SPIFFS.remove(CONFIG_FILE_NAME);          //Delete 
    Serial.printf("\nFLASH Formatted.\n");

    rtcmem.clear();             //Write default values into rtc memory.
    rtcmem.safeDisconnect();    //Saves default values into NVM.

    return(1);  //Returns 1 to inform that FLASH has been erased correctly. This should drive to a reboot.
  }
  else return 0;

}

unsigned char handleResetSentPointer(void){
  Serial.print("\nresetting archive_sent_pointer...");
  rtcmem.var.archive_sent_pointer = 0;
  rtcmem.rwVariables();   //Save variables to RTC memory.
  Serial.printf("\n\n    archive_sent_pointer reset. New value: %d", rtcmem.var.archive_sent_pointer);
  Serial.printf("\n\n    archive_saved_pointer current value: %d", rtcmem.var.archive_saved_pointer);
}

unsigned char handleTurnOffDevice(void){
  Serial.print("\n\n Device set to turn off...");
  statem.setState(STATE_SEALED);
}

bool handleChangeConfig(void){
  /*
    Open configuration file and overwrite the values received. 
    If any entry is invalid or blank/null, don\\\"t overwrite it.
    Also data should be validated from both browser (Javascript code) 
    and this function too, in order to avoid errors.
  */
  //Number of args.
  Serial.print("\n\n (/device_config) - args:\n");
  for (uint16_t i = 0; i < server.args(); i++)
  {
      Serial.printf("\n arg %d->", i);
      Serial.println(String(server.argName(i)));
      Serial.println(String(server.arg(i)));
  }

  // server.arg(0).toCharArray(config_globals.network_ap_ssid, sizeof(config_globals.network_ap_ssid));
  // server.arg(1).toCharArray(config_globals.network_ap_pass, sizeof(config_globals.network_ap_pass));
  // server.arg(2).toCharArray(config_globals.server_ip, sizeof(config_globals.server_ip));
  // server.arg("local_ip").toCharArray(config_globals.local_ip, sizeof(config_globals.local_ip));
  // server.arg("wifi_security_type").toCharArray(config_globals.wifi_security_type, sizeof(config_globals.wifi_security_type));

  // config_globals.server_port=server.arg(3).toInt();
  config_globals.network_connection_timeout=server.arg(4).toInt();
  config_globals.server_connection_retry=server.arg(5).toInt();
  // config_globals.server_connection_timeout=server.arg("server_connection_timeout").toInt();
  // config_globals.response_timeout=server.arg("response_timeout").toInt();
  config_globals.id_transceiver=server.arg(6).toInt();
  config_globals.id_sensor_a=server.arg(7).toInt();
  config_globals.id_sensor_b=server.arg(8).toInt();
  config_globals.id_sensor_c=server.arg(9).toInt();
  config_globals.id_sensor_d=server.arg(10).toInt();
  config_globals.sample_time=server.arg(11).toInt();
  // config_globals.connection_time[0]=server.arg("").toInt();  //6:30 a.m. UTC
  // config_globals.connection_time[0]=server.arg("").toInt();

  Serial.print("\n Configuration parameters modified:\n");
  Serial.print("\n network_ap_ssid:");
  Serial.println(config_globals.network_ap_ssid);
  Serial.print("\n network_ap_pass:");
  Serial.println(config_globals.network_ap_pass);
  Serial.print("\n server_ip:");
  Serial.println(config_globals.server_ip);

  Serial.printf("\n server_port: %d",config_globals.server_port);
  Serial.printf("\n server_connection_retry: %d", config_globals.server_connection_retry);
  Serial.printf("\n network_connection_timeout: %d", config_globals.network_connection_timeout);
  Serial.printf("\n id_transceiver: %d", config_globals.id_transceiver);
  Serial.printf("\n id_sensor_a: %d", config_globals.id_sensor_a);
  Serial.printf("\n id_sensor_b: %d", config_globals.id_sensor_b);
  Serial.printf("\n id_sensor_c: %d", config_globals.id_sensor_c);
  Serial.printf("\n id_sensor_d: %d", config_globals.id_sensor_d);
  Serial.printf("\n sample_time: %d", config_globals.sample_time);

  /* void* p = &config_globals;
  File file = SPIFFS.open(CONFIG_FILE_NAME, "w");
  if (file) {       //If file opened correctly...

      Serial.printf("\nglobals saved:");
      for (uint16 i = 0; i < sizeof(config_globals); i++)
      {
        Serial.printf("%X ", ((const char*)p)[i]);
      }

      file.write((const char*)(p), sizeof(Variables)); //Overwrites previous data.
      file.close();
      return true;
  }

  return false; */
  saveGlobals();
  server.send(200);   //Returns that everything is updated OK.
  return true;
}

unsigned char handleGetParameters(void){
  //Send configuration parameters to the client.
  String parameters = "\"{";
  parameters += "\\\"network_ap_ssid\\\":\\\""+String(config_globals.network_ap_ssid)+"\\\"";
  parameters += ",\\\"network_ap_pass\\\":\\\""+String(config_globals.network_ap_pass)+"\\\"";
  parameters += ",\\\"server_ip\\\":\\\""+String(config_globals.server_ip)+"\\\"";
  parameters += ",\\\"server_port\\\":"+String(config_globals.server_port);
  parameters += ",\\\"network_connection_timeout\\\":"+String(config_globals.network_connection_timeout);
  parameters += ",\\\"server_connection_retry\\\":"+String(config_globals.server_connection_retry);
  parameters += ",\\\"id_transceiver\\\":"+String(config_globals.id_transceiver);
  parameters += ",\\\"id_sensor_a\\\":"+String(config_globals.id_sensor_a);
  parameters += ",\\\"id_sensor_b\\\":"+String(config_globals.id_sensor_b);
  parameters += ",\\\"id_sensor_c\\\":"+String(config_globals.id_sensor_c);
  parameters += ",\\\"id_sensor_d\\\":"+String(config_globals.id_sensor_d);
  parameters += ",\\\"sample_time\\\":"+String(config_globals.sample_time);

  parameters += "}\"";
  Serial.print("\n\nparameters sent to web interface:\n");
  Serial.println(parameters);
  server.send(200, "text/plain", parameters);

